## Titanic Dataset

In [1]:
import datalabframework as dlf

In [2]:
from datalabframework import params

In [3]:
logger = dlf.log.logger()

2018-02-26 14:37:04,142 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - Bootstrapping cluster metadata from [('localhost', 29092, <AddressFamily.AF_UNSPEC: 0>)]
2018-02-26 14:37:04,144 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - <BrokerConnection node_id=bootstrap host=localhost/127.0.0.1 port=29092>: connecting to 127.0.0.1:29092
2018-02-26 14:37:04,148 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - Bootstrap succeeded: found 1 brokers and 3 topics.
2018-02-26 14:37:04,149 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - <BrokerConnection node_id=bootstrap host=localhost/127.0.0.1 port=29092>: Closing connection.
2018-02-26 14:37:04,151 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - <BrokerConnection node_id=1 host=localhost/127.0.0.1 port=29092>: connecting to 127.0.0.1:29092
2018-02-26 14:37:05,257 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - Broker version identifed as 1.0.0
2018-02-26 14:37:05,258 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - Set configuration api_version=(1, 0, 0) to skip auto check_version requests on startup

In [4]:
md = params.metadata()
md['logging']['handlers']['kafka'].get('hosts')

['localhost:29092']

In [10]:
logger.info({'aaaa':'bbbb'})

2018-02-26 14:46:24,055 - INFO - 9f98667 - natbusa - natalino.busa@gmail.com - 1519614067 - True - dsp-titanic.git - elements/extract - extract - {'aaaa': 'bbbb'}

## Extract Data

### Train dataset

In [2]:
train = dlf.engines.get('pandas').read('train')

In [3]:
train.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
546,547,1,2,"Beane, Mrs. Edward (Ethel Clarke)",female,19.0,1,0,2908,26.0000,NaN,S
262,263,0,1,"Taussig, Mr. Emil",male,52.0,1,1,110413,79.6500,E67,S
289,290,1,3,"Connolly, Miss. Kate",female,22.0,0,0,370373,7.7500,NaN,Q
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
63,64,0,3,"Skoog, Master. Harald",male,4.0,3,2,347088,27.9000,NaN,S
414,415,1,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [5]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
train.isin([0,'',None]).sum()

PassengerId      0
Survived       549
Pclass           0
Name             0
Sex              0
Age              0
SibSp          608
Parch          678
Ticket           0
Fare            15
Cabin            0
Embarked         0
dtype: int64

### Test Dataset

In [7]:
test = dlf.engines.get('pandas').read('test')

In [8]:
test.sample(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
247,1139,2,"Drew, Mr. James Vivian",male,42.0,1,1,28220,32.5000,NaN,S
126,1018,3,"Brobeck, Mr. Karl Rudolf",male,22.0,0,0,350045,7.7958,NaN,S
268,1160,3,"Howard, Miss. May Elizabeth",female,NaN,0,0,A. 2. 39186,8.0500,NaN,S
409,1301,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
166,1058,1,"Brandeis, Mr. Emil",male,48.0,0,0,PC 17591,50.4958,B10,C
231,1123,1,"Willard, Miss. Constance",female,21.0,0,0,113795,26.5500,NaN,S
265,1157,3,"Lyntakoff, Mr. Stanko",male,NaN,0,0,349235,7.8958,NaN,S
367,1259,3,"Riihivouri, Miss. Susanna Juhantytar Sanni""""",female,22.0,0,0,3101295,39.6875,NaN,S
150,1042,1,"Earnshaw, Mrs. Boulton (Olive Potter)",female,23.0,0,1,11767,83.1583,C54,C
327,1219,1,"Rosenshine, Mr. George (Mr George Thorne"")""",male,46.0,0,0,PC 17585,79.2000,NaN,C

In [9]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [10]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [11]:
test.isin([0,'',None]).sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp          283
Parch          324
Ticket           0
Fare             2
Cabin            0
Embarked         0
dtype: int64

### Write out Extracted Data from Raw

If format conversion should happen it should be done here. In this particular example we assume that csv is our raw data and from here on all data is going to be compacted in binary format using HDF5 format. HDF5 allows to store multiple pandas DataFrame in the same file. This can be achieve by mapping multiple metadata aliases to the same data resource.

In [13]:
import warnings
warnings.filterwarnings('ignore')

In [14]:
dlf.engines.get('pandas').write(train, '.elements.extract.train')
dlf.engines.get('pandas').write(test,  '.elements.extract.test')

### Metrics on Raw Data

 A table with all the dataset being read
 
 - Number of Entries
 - Null Values
 - Type Purity

In [17]:
pd = dlf.engines.get("pandas").context()

In [18]:
index = ['train', 'test']
data  = [train.isnull().sum(), test.isnull().sum()]
metrics = pd.DataFrame(data, index, dtype='Int64')

metrics['_total'] = [train.shape[0], test.shape[0]]

In [23]:
# display the metrics on null fields
metrics

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,_total
train,177,687,2,0,0,0,0,0,0,0,0.0,0,891
test,86,327,0,1,0,0,0,0,0,0,NaN,0,418

In [24]:
index = ['train', 'test']
data  = [train.dtypes, test.dtypes]
schema = pd.DataFrame(data, index)

schema['_total'] = [train.shape[0], test.shape[0]]

In [26]:
# display the extracted schema for each attribute
schema

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,_total
train,float64,object,object,float64,object,int64,int64,int64,object,int64,int64,object,891
test,float64,object,object,float64,object,int64,int64,int64,object,int64,NaN,object,418

coerce (to be done)

### High Level summary metrics

This metrics are independent on the columns names and the number of columns

In [61]:
data = [train.dtypes.values, test.dtypes.values]
df  =  pd.DataFrame(data)

from collections import Counter
l = [item for sb in df.values.tolist() for item in sb]
d = dict(Counter(l))

#missing column between 'train' and 'test'
d[None]

1

#### For each data set
Collect shape, number of zero, Null, NaN elements, types

In [40]:
list(train.shape)

[891, 12]

In [62]:
[
    train.isin([0]).sum().sum(), 
    train.isin(['']).sum().sum(),
    train.isin([None]).sum().sum(),
    train.isnull().sum().sum(),
]

[1850, 0, 0, 866]

In [63]:
dict(train.dtypes.value_counts())

{dtype('int64'): 5, dtype('float64'): 2, dtype('O'): 5}